// Вычислить площадь круга
class Area {
    public static void main(String args[]) {
        double pi, r, a;
        r = 10.8;       // радиус окружности
        pi = 3.1416;    // значение числа pi
        a = pi * r * r; // вычислить площадь круга

        System.out.println("Площадь круга равна " + a);
    }
}
